{
  "tokenizer_type": "SentencePiece",
  "vocab_size": 32000,
  "model_max_length": 512,
  "special_tokens": {
    "unk_token": "<unk>",
    "bos_token": "<s>",
    "eos_token": "</s>",
    "pad_token": "<pad>"
  },
  "language_configs": {
    "japanese": {
      "do_lower_case": false,
      "strip_accents": false,
      "tokenize_chinese_chars": true
    },
    "english": {
      "do_lower_case": true,
      "strip_accents": true,
      "tokenize_chinese_chars": false
    }
  },
  "preprocessing": {
    "normalize_unicode": true,
    "remove_control_chars": true,
    "clean_text": true
  }
}

