{
  "architectures": [
    "MarianMTModel"
  ],
  "activation_dropout": 0.0,
  "activation_function": "swish",
  "attention_dropout": 0.0,
  "d_model": 512,
  "decoder_attention_heads": 8,
  "decoder_ffn_dim": 2048,
  "decoder_layerdrop": 0.0,
  "decoder_layers": 6,
  "dropout": 0.1,
  "encoder_attention_heads": 8,
  "encoder_ffn_dim": 2048,
  "encoder_layerdrop": 0.0,
  "encoder_layers": 6,
  "forced_eos_token_id": 0,
  "id2label": {},
  "init_std": 0.02,
  "is_encoder_decoder": true,
  "label2id": {},
  "max_length": 512,
  "model_type": "marian",
  "normalize_before": false,
  "num_beams": 4,
  "num_hidden_layers": 6,
  "pad_token_id": 0,
  "scale_embedding": true,
  "static_position_embeddings": true,
  "transformers_version": "4.18.0",
  "use_cache": true,
  "vocab_size": 32000,
  "source_lang": "en",
  "target_lang": "ru",
  "model_name": "English to Russian Comic Translation Model",
  "model_version": "1.0.0",
  "author": "Mr.Comic Team",
  "description": "Модель для перевода текста комиксов с английского на русский язык"
}

